---
type: BoundarySegment
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# BoundarySegment

`Autodesk.Revit.DB.BoundarySegment` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurve | 2016 | `public Curve GetCurve ()` |
| Property | ElementId | 2016 | `public ElementId ElementId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LinkElementId | 2016 | `public ElementId LinkElementId { get ; }` |